{"podcast_details": {"podcast_title": "The Really Good Podcast", "episode_title": "Tyga: “It’s random… it’s awkward”", "episode_image": "https://d3t3ozftmdmh3i.cloudfront.net/production/podcast_uploaded_nologo/37861167/37861167-1684790364129-3335e91127bb8.jpg", "episode_transcript": " Hi guys, thank you for tuning in to the Really Good Podcast. My name is Bobbi Althoff and I'm here today with my guest. Can you introduce yourself please? My name is Tyga. That's your government name? My government name? No. What's your real name? Michael. You know what it means? Closest to God. It means what? Closest to God. Michael. Michael does? Yeah. And what does Tyga mean? Thank you God always. That's why I spelled Tyga. That makes sense. When did you come up with that name? When I was like maybe 13, 14. How old are you now? 33. So a few years ago. A few years ago. Yeah. 13, 15, I don't know. My math is kind of off. So you're a singer? Rapper, artist. A rapper? Don't let the animal touch your drink. What is he eating? Corn. Do you like corn? It's okay. It does nothing for the body. That's true. Do you think it does anything for his body? I mean the way he's killing it. This is so interesting. It's a porcupine sitting here. This is so awkward. What are we doing here today? We're here because my name is Tyga, right? You want it to be funny? What do you mean? Because you're like Tyga? There's no Tyga's here. I know. Well, me. You're not a tiger. Tyga. Yeah. No, that's not why we're here. How do you know Drake? We were signed to the same label. Right now? Not anymore. We were though. Okay. Through Lil Wayne's label. Young Money, Cash Money. How did you see it? Did he tell you before that post came out? Or did you just see it on his page? No, I just seen it. I just seen it on Instagram. He just tagged you out of nowhere. It was funny because I seen your page. You did an interview with Funny Marco. I just thought it was hilarious. I followed you from that. No, you didn't. I did, no? No. I feel like I did. I feel like you didn't. I think I did. I'm pretty sure I did. No. I'm pretty sure you didn't. Well, I followed you in the span of... Yeah. No, you didn't then. Seven days. You were like, oh no, if Drake will do it, then I guess I will be on. But I wasn't cool enough before. So you wrote that song that Drake played. Rock City? Yeah. Long time ago when I was like... How long ago? When I was 20 maybe. I was 21 or 20. You're writing about rock in the city? 2021. I didn't write it. I just like... I just freestyled it. What does that mean? Well, I kind of just threw the beat on and I just mumbled a few lines and then... Can you mumble them right now? What, Rock City? Mm-hmm. Like the lyrics? Mumble a few lines right now. I need a beat. Okay. Can you make a beat at the same time? No. I have a son. He likes juices like that and stuff. Do let your son have juice. It's really bad for him. Really? Mm-hmm. It's not good for me either, but I like to live life on the edge a little bit. It's better than a soda. Well, yeah, he doesn't need... He just needs water. What do you want to talk about today? I don't know. I'm open book today. It's like an open conversation. If there was one thing that you wanted people to know about you, what would it be? I don't know. I don't know what I want people to know about me. I feel like I like the mystique sometimes. The what? Mystique. I've never heard that word before. Mystique? Yeah, never heard that word. The mystery of not knowing so much about somebody. So you don't want people to know anything about you? Are you a nice person? I think I'm a nice person. What's your favorite game? I like intentional. I have good intentions. Okay. What's your favorite game to play? My favorite game? Yeah, board game. Board game? Monopoly. Why? No one likes that. No one enjoys playing Monopoly. Did you make that up? That's because I win all the time. People don't like it because they don't win. No one finishes the game because it takes forever. Who do you make play that with you? Whoever. When people come over to your house, you're like, let's just play Monopoly right now. A group of friends or for like on a trip vacation or something. You get drunk, play Monopoly. It's a long game though. So most of the time people quit. Yeah. That's why I like it. That's why you win. I just want people to quit. Just because people quit. Sad. It's fun though. What's your favorite game? Scrabble. Scrabble. Yeah. Okay. Are you good at spelling? Sure. Spell porcupine. Oh shit. It's tough. Try. Sound it out. P-O-R-Q. Why can I not spell porcupine right now? Is it porcupine or porcupine? Porcupine. I think there's no Q. I think it's a C-U-P-I-N-E. Right? Porcupine. Porcupine. I'm not going to lie. That's a hard one. You think he's going to eat this whole bowl by the time we're done? Yeah. You should stick your finger right there to see what he does. I think you should stick your finger to see what he does. What's on your finger? Where? The ring. A tattoo or ring? The ring. This one? It's just a tongue. Rolling stone tongue. How much was that? That's not too expensive. What's not too expensive to you? Might have been like 40 grand or something like that. That's not too expensive? It's custom. It says lick it on the inside of it. Why would it say that? Because it's a tongue. I just thought it would be funny. It's custom. You went to a designer and you're like, I want a tongue that says lick it. They're like, okay. Here, give me $40,000. You gave them that? Sounds pretty dumb, right? Yeah. Can I have $40,000? To do what with? I just want $40,000. Do you have a lot of money? I feel like I have a fair amount that I work hard for. Yeah. You know, I paid $1,800 for us to do this here. Okay. Do you want me to reimburse you? That would be nice. Are you offering? Okay. Okay. That would be nice. That's fair. That's really nice of you. You don't have to do that though, because I know that it's my podcast, but I just know that you have a lot of money. I put it on a credit card. You like money a lot. That's because I don't have any. I learned that from your last interview. Yeah. Well, I don't have any. You live in Newport Beach though, right? I live in Laguna Beach. Oh, Laguna Beach. I spend 100% of the money I make on my rent. Okay. I put everything also on credit cards. Do you have credit cards? Yeah. You do? Yeah. Let's just keep him. And you're going to put out an album? Yeah. I'm doing a joint album with an artist called Artist YG. Okay. I've heard of him. YG? Yeah. What does YG stand for? I have no idea. What do you think it stands for? Like if it stands for something? Your...I don't really know. Your grandpa? Your grandpa? Your grandpa. Why would somebody's rap name be Your Grandpa? No, it stands for Young Gangster. Oh, I would not have guessed that. So we have a project that we're doing, and then I have my own project. Okay. And you're... And we're doing like a tour, so... A tour? We're pretty busy. How many people come to your tours? I didn't know you went on tour. Yeah. It just depends. Like sometimes if it's like a festival or like a one-off show... What are you doing? I'm trying to...it's flies everywhere. Hmm? It's flies. I don't see any. Something's like falling on me or something. Like it's probably the sloth. Do you wash your own clothes? No, dry cleaner. You dry clean all of your clothes? Yeah. Do you drive them to the dry cleaners or do people... No, they pick them up. It's like a weekly thing. They come and pick them up and wash all of your clothes for you? Yeah, so that way they don't like...they don't shrink. You know what I mean? Yeah. No. I have to wash my own clothes. I just have to deal with them shrinking. I just don't want my shirts and like certain things that I like, jeans, to be ruined and stuff. Yeah, when I have a lot of money, I'll probably do that too. You don't have to have a lot of money to dry clean. It's not expensive. Go ask anybody without a lot of money if dry cleaning is expensive. You're going to have a lot of money real soon, so... I hope so. Why do you think so? I think you have a bright future. You do? Yeah. How much? Is it because you're going to give me money or because I'm just going to earn money? No, no, I just think like good things are going to happen for you. That's very nice of you. Yeah. You think good things are going to happen for me? For you? Yeah. I think you've already had a pretty good life. What else could happen to you that's good? I feel like you can always have more, right? More what? Just like everything. I'm trying to feed him not a plant. It's so hot. It's not that hot. Please stop saying that. Are you complaining about it? My tattoo is peeling. My tattoo is peeling? Is it new? Yeah, well I just redid it. Why? I just wanted to update it. You can't tell. What? Why would you do that? Because most of my tattoos I got when I was like 16. He's eating my phone. I think he's eating my phone. Hello. He doesn't like the food that they brought him. Why don't you try? He wants that juice. I'm telling you. Everybody loves juice. Why didn't you take the carrot when I tried to hand it to you? I want to see what happens when you feed it first. You didn't even like acknowledge that I tried to hand it to you though. That was kind of rude. Do you want me to try to feed him next? Yeah, will you try because he's not actually listening to me. Maybe he doesn't want a carrot. Maybe he wants corn or candy or something. Can you do that then? Offer him something better. Let's see if he wants this. Okay. He's accepting your offer. Maybe. What is this? Is this like a... Oh, it's a potato. Oh. I was going to give it to you. I think he wants you to hold it the rest of the time. It's going to fall. What were we talking about? I don't know. You like to talk about money a lot. Yeah. Don't make me feel weird about that. No, I'm not. Yeah. I'm sure before you had money you also thought about money a lot. Yeah. Money is money but you know. It makes life easier. He obviously doesn't want this food anymore. They need better snacks for him. Goodbye. What's that? Oh, yeah. Are you going to do that right now? Can I? It's really hot. Are you going to hold a fan? Huh? You're going to hold a fan. Thank you. Feels good, right? I'm good. Oh, you want to. That was really nice of your friend. How much did you pay him to do that? He just did it out of the kindness of his heart. That's the type of people we are, you know. It's really hot though. Thank you. It's awesome to think. All right, can you stop doing that now? Okay. Let me just cool my body down a little bit. Let's cool down. Did that do anything? I feel like you just went right back to whatever temperature you were at. I don't know. I feel like it did. I messed up the audio of my podcast so you could cool yourself down for two seconds. It's really hot. You can sit in discomfort for a little bit of time. I know you don't have to do that a lot, but maybe for a second. I'm here for you. I just know any minute this sloth is going to try to grab my shoulder or something. That will make headlines. No, I don't want to be attacked by a sloth. It might make you money. You maybe can buy a private plane. That would be nice. You're going to make a lot of money though. I know. I see it for you, you know. Yeah, me too. It's going to be good. Yeah. Are you a nice person? Yeah. Yeah, I can be for sure. Yeah. Definitely. I can't tell when you were texting me if you were nicer. I'm not a good texter. Okay. Really. I'm like, it just depends, you know. Yeah. I was like, I don't know if he's going to be nice or mean. I still can't tell, but. I'm pretty very like reserved and intuitive, so I'm like. Do you want to keep messing up the audio and do that again? Maybe next time you could hold it closer to the microphone so that it's just, that's all it picks up. But now it can't hear you. I wasn't talking. What type of girls are you attracted to? What type of girls? Yeah. Do you have a girlfriend? A wife? A husband? What? Do you have a husband? Girlfriend? No. It's complicated. But what type of girls I'm attracted to? Definitely like somebody that's like down to earth. I like attracted to beauty, of course. You know, somebody that gives me like peace of mind, somebody that's like real chill. But like a little bit of crazy. A little bit of crazy? Just a little bit. Like what type of crazy? Like if you don't text her back, she might. No, not like crazy, crazy, but just like, you know, somebody like that's still going to like bring excitement, but not be like too OD, you know? Yeah. Too what? OD. What's that? Like, like over, like it's overdoing it. Like, like overdose. Like why'd you say, okay. Too OD. It's like this, you know what I mean? Yeah. What'd you say? You have high standards or no? High standards? Yeah. Just will you date anyone? Do they have to be famous? They don't have to be famous. Have you ever dated someone that wasn't famous? Yeah. Yeah, for sure. Both. Huh? Yeah, I have. Yeah. Would you put a picture of my face on your next album? No. Why? That's weird. I didn't think you'd say no that fast. I thought you would like nicely say it maybe. Like you'd be like, oh, well, I would have to ask maybe my team if that was okay. You could have said that nicer though. There's definitely a more gentle way of saying that. Really? Maybe like no. Maybe like what? Huh? What? What's so funny? It's just so hot. Okay. Well, thank you so much for this interview. I'll let you ask me a few more questions and then we can go. How old are you? I'm 25. Oh, yeah. And you grew up in Corona? Mm-hmm. You went to high school, college, and Corona? I didn't go to college. Just high school, Corona. I was too stupid to go to college. I didn't go to college. Were you too stupid or you just didn't want to go? No, I just... Could you get into college? Could I get into college? Yeah, with your grades. I'm pretty sure if I wanted to. I couldn't. If I applied myself, but I was already doing music by then. I was signed when I was 17. I wasn't doing anything before this podcast. I was not really doing anything with my career. This is good. Yeah. Do you feel like now you have more purpose now? Yeah, I definitely have more purpose. I feel really good about myself. That's good. I think that's what it's about. Yeah. Not so much about the money because the money comes, right? Yeah. But if you feel like you have purpose and you're applying yourself. Yeah, I had no purpose a week ago. A week ago. Why a week ago? I really did have no purpose. That's good because sometimes things just fall in line. It's all about timing. Yeah. I haven't heard these parakeets say one thing the whole interview. Don't they usually talk if you say something? That one just did over there. It said hello. There you go. He said it for you. Did you hear that? Because you wanted to do this in a zoo, I'm probably going to come home with so many bites on me. Yeah, it's a lot of flies. Maybe you should think about that the next time someone's like, oh, let me interview you. And you're like, we do it at a zoo. Well, you wanted to do it at a zoo. No. Yeah, you was like, this might sound crazy, but what about a zoo? And I was like. I said a zoo, question mark. Don't add words. I said a zoo. You said, where should we do it? I said a zoo, question mark. You said you wanted to do it at a cool place. Yeah, but it was your idea. And actually, do you want to know whose idea it was? Drake's. Yeah, you should interview Ty got a zoo. No, he said I said, where is a place I should do it? And he said a zoo. I was like, that's crazy. I don't know. It's random. It's awkward. But I guess don't call it awkward. We're here. Don't call it awkward. Why? We can cut that part. OK. Just say something nice about it. Oh, we're here. We're here. Yeah. I feel like when you look at people, like you're looking at them, it's to give them a signal, like you're trying to end this conversation. No, I'm just looking for engagement. You're supposed to pretend they're not there. You shouldn't be trying to engage with them. Oh, I didn't know. Nobody told me prior. That you shouldn't look at them? Please stop doing that. I could try. It's like natural. It's like, you know, look at your homies. I haven't looked at my friend one time. Why not? Because you should always check in on your homies. Not during the middle of an interview. You don't think so? Am I annoying you because I keep looking back and forth? It just feels like you're trying to signal that you want this to be over. I'm just... You seem really afraid of everything. I'm not. Are you tough? Would you describe yourself as tough? No, I'm not tough. I'm just me. What type of car do you drive? Right now, I drove a Maybach here. What's that? A Maybach? Yeah. It's like a Mercedes, like an extended version of a... Did you drive it or you have a driver? No, my sister drove. Did you pay her to drive you here? Pay him. Well, it's just part of the job description, I feel like, right? To drive you places? No, I mean, you know, it's just like whatever to get the job done, you know? Do you have an assistant? No. One day. You'll probably get one probably soon. When? I'd say like within a month. Wow. Yeah, you're going to need an assistant. Okay. Do you want to be my assistant? No. Why? Because I'm not an assistant. I don't think I'd be a good assistant. I think you would. I can like, maybe I can be like a good advisor, but... You could be a good assistant. I don't think so. Anyone can do whatever they want. True. Do you want to be my assistant? I don't want to be assistant. Why? That's why I won't be an assistant. You don't want to be an assistant, but you'll be mine. If I text you tomorrow and I'm like, hey, can you have someone come pick up my dry cleaning? What will you say back? They probably wouldn't text you back until like a day later and be like, yo, what's up? That's not... I'm going to do that. I would just ignore the text and just say something else. What if I say, hey, it's really important. Can you please feed my dog? What are you going to do? I would just put like LOL or something. You're just going to let it die? Because my dog is at home right now and it doesn't have any food. I just text you and I said, hey, can you please come feed my dog? I know you wouldn't be serious. I'm going to be so serious. I'm going to leave my kids at home. I say, hey, can you please arrange someone to come watch them? You have a dog? What kind of dog do you have? I was just... That was not... I'm talking about my kids now. So you don't have a dog. So I text you and I say, hey, my kids are... You have a dog? Well, fuck that. Okay. I text you tomorrow. I'm going to text you and I'm going to say, hey, my kids are home alone right now. Can you please get send someone there right now? You're going to send someone or no? No. Okay. Just wanted to know what type of person you are. My kids are home alone. Send someone. Why would they be home alone? Well, they're about to be. I'm about to leave. I'm running out. You have time though if you want to pull some strings to get a babysitter there. Oh, you mean like, can you find a babysitter like a nanny? Yeah. Yeah, I could probably help you find a nanny or a babysitter. Okay. So you are my assistant. I just wanted to get clarity of our relationship going forward. I'm a resourceful person so I can be resourceful, but I'm not an assistant. I think assistants are resourceful. Yeah. So I think that you could be my assistant. I'm thinking that this is your new. I just want to see where our relationship is going to be after this interview. We'll see. We'll see. We'll see where it goes. Yeah. I think that you could be like a friend slash assistant to me. Can you get me some water, please? Can we get a water? No, you get the water. You're my assistant. You want this one? I drink out of it. Oh, then no. I don't know what you have. I don't have to have something. You can have your water. I don't actually need water, so. Okay. I'm sure. Well, now I do. I think there's no more juice in there. Okay. Well, will you get this video edited when it's done? Will I what? Get this video edited for me when it's done? Just make sure you do not understand that word. What? Edit it? You want me to say it again? Oh, you want me to edit this video? Edit, yes. Why won't I edit it? Because you're my assistant. This is your podcast. Why do you? I'm a guess of you. Why do you keep forgetting that we just discussed this? I'm not an assistant. You're my assistant. I'll be your assistant. Okay, thank you. Let's see how it goes. Okay. I'll do everything in my power to get fired. I'm not going to fire you. I'm not going to fire you. I'm not going to fire you. I'm not going to fire you. I'm not going to fire you. I'm not going to fire you. I'm not going to fire you. Okay, we'll see. You're going to be stuck. I'm going to be the shittiest assistant ever, and you're going to be like, I'm going to fire you. I'm going to do everything in my power to get fired. So I'll be your assistant starting today. How much do you want to be paid? What are you offering? Five dollars. But you can get a small percentage of my brand deals. Like five percent. So it's almost like a management thing. No, you're my assistant, but you're just working on good things because eventually I'll may have money. But if I get a percentage of your brand deals, that's kind of like a manager. There's a lot of people who get percentages. It doesn't make them your manager. True. Yeah. All right. Well, you're not going to get fired because I'm not going to let that happen. And I look forward to seeing where our relationship goes. Thank you. Yeah, we'll see. Have a good day. Okay. Are we done? Okay. Are we just taking like a break? You want to laugh right now, right? I think you're breaking character. No, I don't say breaking character. What do you mean? Doesn't make sense. Thank you for coming today. Thank you for having me at it too. Say my name. Do you know my name? Bobby. But I, right? Yeah. Thank you. All right. Bye. Why aren't you like taking that as an invitation to get up and leave? I just it doesn't feel like a good closing. Then go ahead close it. You can say what you want. You'll have the final sentence. Even put my mic down. I'm not going to pick it up anymore after this time either. Okay. This was fun. I'm Tiger. Thanks for having me at a zoo, Bobby. I hope our friendship grows and I hope you make a lot of money and so you can be happy forever. Yeah. Thanks for having me. Don't forget to send me the $1,800."}, "podcast_summary": "In this podcast episode, Bobbi Althoff interviews Tyga, a rapper and artist. They discuss topics such as Tyga's name, his music, his relationship with Drake, and his future projects. The conversation also touches on personal preferences, like favorite board games and types of relationships. Overall, the interview is light-hearted and casual, with moments of humor and banter between the host and guest.", "podcast_guest": {"name": "Tyga", "org": "", "title": "", "summary": "Not Available"}, "podcast_highlights": "Highlight 1 of the podcast: \"I think you have a bright future. That's very nice of you.\"\nHighlight 2 of the podcast: \"Money is money, but if you feel like you have purpose and you're applying yourself.\"\nHighlight 3 of the podcast: \"I feel like you can always have more, right? More of everything.\"\nHighlight 4 of the podcast: \"You're going to make a lot of money though. I know it.\"\nHighlight 5 of the podcast: \"I just think good things are going to happen for you.\""}